---
kind: method
id: M:Autodesk.Revit.DB.ElementId.op_LessThanOrEqual(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
source: html/ba605698-2cc5-7db5-f07e-33e9b550b9f6.htm
---
# Autodesk.Revit.DB.ElementId.op_LessThanOrEqual Method

Determines whether one element id is not greater than another element id.

## Syntax (C#)
```csharp
public static bool operator <=(
	ElementId elementId1,
	ElementId elementId2
)
```

## Parameters
- **elementId1** (`Autodesk.Revit.DB.ElementId`) - The first ElementId.
- **elementId2** (`Autodesk.Revit.DB.ElementId`) - The second ElementId.

## Returns
True if the first element id is not greater than the second element id, otherwise, false.